>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION. 
PROGRAM-ID. cobolintro3.
AUTHOR. YuFeng Yao.
DATE-WRITTEN.May 4th, 2022
ENVIRONMENT DIVISION.

DATA DIVISION. 
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
STOP RUN.